#include <iostream>
using namespace std;
// 数组特点：放在一块连续的内存空间中，数组中每个元素都是相同的数据类型
int main() {
    /*
        数组三种定义方法
        1. 数据类型 数组名[数组长度];
        2. 数据类型 数组名[数组长度] = {值1， 值2， 值3...};
        3. 数据类型 数组名[] = {值1， 值2...};
    */
    // int arr[5];
    // arr[0] = 10;
    // arr[1] = 20;
    // arr[2] = 30;
    // arr[3] = 40;
    // arr[4] = 50;
    // // 访问数组元素
    // cout << arr[0] << endl;

    // // 2.数据类型 数组名[数组长度] = {值1， 值2， 值3...};
    // // 如果在初始化时数据未全部填写，会用0来填补剩余数据
    // int arr2[5] = {10, 20, 30};
    // for (int i=0; i<5; i++)
    // {
    //     cout << arr2[i] << endl;
    // }

    // 3. 数据类型 数组名[] = {值1， 值2...};
    // 定义数组的时候，必须有初始长度
    int arr3[] = {90, 80, 70, 60, 50, 40, 30, 20, 10};
    for (int i=0; i<9; i++)
    {
        cout << arr3[i] << endl;
    }

    return 0;
}